# AnalysisDisplayVectorSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings Class
Members See Also
---
Contains vector settings for analysis display style element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AnalysisDisplayVectorSettings : IDisposable
```

Visual Basic
---
```text
Public Class AnalysisDisplayVectorSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AnalysisDisplayVectorSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..AnalysisDisplayVectorSettings
# See Also
AnalysisDisplayVectorSettings Members
Autodesk.Revit.DB.Analysis Namespace